; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v1 ?v4)
             (pred_2 ?v7 ?v6)
             (pred_9 ?v1 ?v6)
             (pred_6 ?v3 ?v1 )
	     (pred_7 ?v1)
             (pred_4 ?v5)
             (pred_11 ?v7)
             (pred_12 ?v6)
             (pred_3 ?v1)
             (pred_1 ?v7)
             (pred_5 ?v1)
             (pred_10 ))



(:action op_4
:parameters (?v10 ?v12 ?v11 ?v2)
:precondition (and (pred_4 ?v10) (pred_4 ?v12) (pred_11 ?v11) (pred_12 ?v2)
          (pred_8 ?v10 ?v12) (pred_2 ?v11 ?v2)
                   (pred_9 ?v12 ?v2) (pred_7 ?v10) 
                   (pred_3 ?v12) (pred_1 ?v11))
:effect (and  (pred_5 ?v12) (not (pred_3 ?v12))))


(:action op_5
:parameters (?v10 ?v8)
:precondition (and (pred_4 ?v10) (pred_4 ?v8)
               (pred_7 ?v10) (pred_8 ?v10 ?v8) (pred_5 ?v8))
:effect (and (pred_7 ?v8) (not (pred_7 ?v10))))

(:action op_2
:parameters (?v10 ?v11)
:precondition (and (pred_4 ?v10) (pred_11 ?v11) 
                  (pred_7 ?v10) (pred_6 ?v11 ?v10) (pred_10 ))
:effect (and (pred_1 ?v11)
   (not (pred_6 ?v11 ?v10)) (not (pred_10 ))))


(:action op_3
:parameters (?v10 ?v9 ?v13)
:precondition (and (pred_4 ?v10) (pred_11 ?v9) (pred_11 ?v13)
                  (pred_7 ?v10) (pred_1 ?v13) (pred_6 ?v9 ?v10))
:effect (and (pred_1 ?v9) (pred_6 ?v13 ?v10)
        (not (pred_1 ?v13)) (not (pred_6 ?v9 ?v10))))

(:action op_1
:parameters (?v10 ?v11)
:precondition (and (pred_4 ?v10) (pred_11 ?v11) 
                  (pred_7 ?v10) (pred_1 ?v11))
:effect (and (pred_10 ) (pred_6 ?v11 ?v10) (not (pred_1 ?v11)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_05 obj_10 obj_06 obj_07 obj_08 obj_03 obj_11 obj_09
    obj_13 obj_02
    obj_12 obj_04
    )

    (:init
       (pred_10)

       (pred_4 obj_01)
       (pred_4 obj_05)
       (pred_4 obj_10)
       (pred_4 obj_06)
       (pred_4 obj_07)
       (pred_4 obj_08)
       (pred_4 obj_03)
       (pred_4 obj_11)
       (pred_4 obj_09)
       (pred_12 obj_13)
       (pred_12 obj_02)
       (pred_11 obj_12)
       (pred_11 obj_04)

       (pred_8 obj_01 obj_06)
       (pred_8 obj_01 obj_05)
       (pred_8 obj_05 obj_07)
       (pred_8 obj_05 obj_10)
       (pred_8 obj_05 obj_01)
       (pred_8 obj_10 obj_08)
       (pred_8 obj_10 obj_05)
       (pred_8 obj_06 obj_03)
       (pred_8 obj_06 obj_07)
       (pred_8 obj_06 obj_01)
       (pred_8 obj_07 obj_11)
       (pred_8 obj_07 obj_08)
       (pred_8 obj_07 obj_05)
       (pred_8 obj_07 obj_06)
       (pred_8 obj_08 obj_09)
       (pred_8 obj_08 obj_10)
       (pred_8 obj_08 obj_07)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_03 obj_06)
       (pred_8 obj_11 obj_09)
       (pred_8 obj_11 obj_07)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_09 obj_08)
       (pred_8 obj_09 obj_11)
       (pred_3 obj_03)
       (pred_3 obj_10)
       (pred_9  obj_03 obj_13)
       (pred_9  obj_10 obj_02)
       (pred_5 obj_01)
       (pred_5 obj_05)
       (pred_5 obj_06)
       (pred_5 obj_07)
       (pred_5 obj_08)
       (pred_5 obj_11)
       (pred_5 obj_09)

       (pred_2  obj_12 obj_13)
       (pred_2  obj_04 obj_02)
       (pred_6 obj_12 obj_08)
       (pred_6 obj_04 obj_05)
       (pred_7 obj_09)
    )

    (:goal (and
       (pred_6 obj_12 obj_11)
    ))
(:constraints
  (always (not (pred_7 obj_07)))
)
)

; plan
1. (op_5 obj_09 obj_08)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_08)
   goals met: 0 of 1
2. (op_2 obj_08 obj_12)
   deleted: (pred_6 obj_12 obj_08) (pred_10)
   added: (pred_1 obj_12)
   goals met: 0 of 1
3. (op_5 obj_08 obj_09)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_09)
   goals met: 0 of 1
4. (op_5 obj_09 obj_11)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_11)
   goals met: 0 of 1
5. (op_1 obj_11 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_10) (pred_6 obj_12 obj_11)
   goals met: 1 of 1
